[
  "My inner peace committee vetoed this idea unanimously.",
  "I respect the opportunity, but I know my limits—and this would stretch them too far.",
  "Please know that my decision isn’t a reflection of you—just my own boundaries.",
  "That’s not something I can prioritize at the moment.",
  "I’ve learned to protect my time, and this doesn’t align with how I want to spend it.",
  "I’ve decided to hold off on new engagements for the time being.",
  "You’ve put great energy into this, and I hope you understand my decision to step back.",
  "I’m not in a position to commit to this right now.",
  "I'd love to say yes, but I just made a commitment to do less questionable things this week.",
  "Thanks for thinking of me, but I’ll have to pass on this one.",
  "It’s not a no forever, but it’s a no for now.",
  "I once made a similar decision and my cat hasn’t looked me in the eye since. Let’s not repeat history.",
  "Saying no to this helps me say yes to something that matters more to me.",
  "I truly value our connection, and I hope my no doesn’t change that.",
  "It sounds interesting, but I’m not the best person for this.",
  "I want to be honest with you—I don’t feel comfortable committing to this.",
  "At this point, I don’t have the bandwidth to do this justice.",
  "I’ve taken some time to reflect, and I believe passing on this is the right call for now.",
  "I'm trying to be more intentional with what I agree to, and this doesn’t quite fit.",
  "I know how much this matters, but I can’t give it the attention it deserves.",
  "I’m going to respectfully decline. It doesn’t align with where I’m heading.",
  "I appreciate the thought, but it’s not the right fit for me right now.",
  "If I said yes, I'd be lying to both of us—and my therapist said to stop doing that.",
  "This feels like something Future Me would yell at Present Me for agreeing to.",
  "This one doesn’t feel quite right, so I’ll have to pass.",
  "I truly value our connection, and I hope my no doesn’t change that."
]
